src/OpenFoam/Airfoil_simulation_1/OpenFOAM_0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	#includeFunc internalCloud
	forceCoeffs1
	{
	// Mandatory entries
	type forceCoeffs;
	libs ("libforces.so");
	patches (aerofoil);

	// Reference pressure [Pa]
	pRef 0;

	// Include porosity effects?
	porosity no;

	// Centre of rotation for moment calculations
	CofR (0 0 0);

	// Lift direction
	liftDir (0 1 0);

	// Drag direction
	dragDir (1 0 0);

	// Pitch axis
	pitchAxis (0 0 1);

	// Freestream velocity magnitude [m/s]
	magUInf 59.393;

	// Reference length [m]
	lRef 1;

	// Reference area [m2]
	Aref 1;
	rho rhoInf;
	rhoInf 100000;
	}
}


// ************************************************************************* //
